# Homebrew Services
tap "homebrew/services"

# Languages & Runtimes
brew "go"
brew "node"
brew "rustup-init"

# Development Tools
brew "cmake"
brew "delve"
brew "gopls"
brew "golangci-lint"
brew "neovim"

# Container Tools
cask "docker-desktop"
brew "docker-compose"

# CLI Utilities
brew "bat"
brew "choose"
brew "cloc"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "jq"
brew "jj"
brew "mkcert"
brew "nmap"
brew "openvpn"
brew "ripgrep"
brew "sd"
brew "tldr"
brew "tnftp"
brew "uv"
brew "wget"
brew "wireguard-tools"
brew "yarn"

# Applications
cask "google-chrome"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

# VSCode Extensions
vscode "editorconfig.editorconfig"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mkhl.shfmt"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "rust-lang.rust-analyzer"
vscode "ryanolsonx.distilled"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "ziglang.vscode-zig"

# Go packages
go "github.com/go-delve/delve/cmd/dlv"
go "mvdan.cc/gofumpt"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/lint/golint"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"

# Note: cargo-asm is a Rust tool that should be installed via cargo
# After rustup is installed, run: cargo install cargo-asm
