# Languages & Runtimes
brew "go"
brew "node"
brew "rustup-init"

# Development Tools
brew "cmake"
brew "delve"
brew "gopls"
brew "golangci-lint"
brew "neovim"

# Blog
brew "hugo"

# Container Tools
brew "docker-compose"
cask "docker"

# SVC
brew "gh"
brew "jj"

# CLI Utilities
brew "bat"
brew "cloc"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "jq"
brew "mkcert"
brew "nmap"
brew "openvpn"
brew "ripgrep"
brew "sd"
brew "tealdeer"
brew "tnftp"
brew "uv"
brew "wget"
brew "wireguard-tools"
brew "yarn"


# VSCode Extensions
vscode "editorconfig.editorconfig"
vscode "golang.go"
vscode "ryanolsonx.distilled"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"

# Go packages
go "github.com/go-delve/delve/cmd/dlv"
go "mvdan.cc/gofumpt"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/lint/golint"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
